# Defense Tackle Rank

In [1]:
import pandas as pd

In [2]:
defs = pd.read_csv('../Capstone_Scrapping/Capstone_text_files/defense_17-18.txt')

In [3]:
defs.rename(columns=lambda x: x.strip(), inplace = True)

In [4]:
defs = pd.DataFrame(defs)

In [5]:
defs.columns

Index(['NAME', 'RTG', 'TEAM', 'GP', 'TCKL', 'SOLO', 'AST', 'TFL', 'SCK',
       'SCK YDS', 'QBH', 'PASS DEF', 'FF', 'FUMR', 'FUMR YDS', 'FUMR TD',
       'INT', 'INT YDS', 'INT TD'],
      dtype='object')

In [6]:
defs = defs[['NAME', 'TCKL']]

In [7]:
defs.head()

                NAME  TCKL
0     Blake Martinez   145
1      Preston Brown   144
2       Joe Schobert   141
3  Christian Kirksey   139
4        Deion Jones   138

In [8]:
defs['TCKL_rank'] = defs['TCKL'].rank(ascending = False)

In [9]:
defs

                  NAME  TCKL  TCKL_rank
0       Blake Martinez   145        1.0
1        Preston Brown   144        2.0
2         Joe Schobert   141        3.0
3    Christian Kirksey   139        4.0
4          Deion Jones   138        5.0
..                 ...   ...        ...
195      Rodney McLeod    54      194.5
196        Ken Crawley    54      194.5
197      Mike Mitchell    54      194.5
198           AJ Klein    54      194.5
199     Jaquiski Tartt    54      194.5

[200 rows x 3 columns]

In [11]:
defs.to_csv('../Capstone_csv_file/defense_tackle_rank_17-18.csv')